Repository: Hipheckts/woocommerce-payment-gateway-everypay
Catalog: languages/everypay-*.po
Languages: et

source: Unable to verify action, please try again.
et: Tegevuse õiguse tuvastamine ebaõnnestus.

source: Card deleted.
et: Kaart kustutatud.

source: Unable to delete card.
et: Kaardi kusutamine ei õnnestunud.

source: Card set as default.
et: Kaart seatud vaikimisi kasutavaks.

source: Unable to update card.
et: Kaardi vaikimisi kaardiks muutmine ei õnnestunud.

source: Pay by card
et: Maksa kaardiga

source: Card payments are provided by EveryPay
et: Kaardimaksete lahenduse eest hoolitseb EveryPay

source: EveryPay is a card payment gateway service provider, enabling e-commerce merchants to collect credit and debit card online payments from their customers.
et: EveryPay on krediit- ja deebetkaardimaksete vastuvõtmise teenus e-kaubanduse jaoks.

source: Merchant Portal
et: Kaupmeheportaal

source: Contacts
et: Kontaktid

source: Documentation
et: Dokumentatsioon

source: EveryPay Error: EveryPay requires PHP 5.3 and above. You are using version %s.
et: EveryPay viga: EveryPay nõuab PHP versiooniks vähemalt 5.3. Sinu serveris on kasutusel versioon %s.

source: EveryPay Error: Please enter your API username and secret.
et: EveryPay viga: Palun sisesta API-liidese kasutajanimi ja salasõna.

source: EveryPay Error: Please enter your TEST API username and secret.
et: EveryPay viga: Palun sisesta TEST API-liidese kasutajanimi ja salasõna.

source: EveryPay Error: Please enter your Processing Account.
et: EveryPay viga: Palun sisesta maksete konto.

source: EveryPay payment gateway is in test mode, real payments not processed!
et: EveryPay makseliides on test-režiimis, päris makseid ei toimu!

source: EveryPay iFrame mode is enabled, but your checkout is not forced to use HTTPS. While EveryPay iFrame remains secure users may feel insecure due to missing confirmation in browser address bar. Please <a href="%s">enforce SSL</a> and ensure your server has a valid SSL certificate!
et: EveryPay maksed on määratud kasutama iFrame vormi, aga kassas ei ole jõustatud HTTPS kasutamine. See ei mõjuta otseselt EveryPay serverist kuvatava maksevormi turvalisust, küll aga võib jätta kahtlase mulje kasutajatele kes on harjunud kontrollima rohelist tabalukku brauseri aadressi-real. Palun <a href="%s">jõusta SSL kasutamine</a> ning veendu, et serveril on kehtiv ja tunnustatud sertifikaat!

source: For translation with WPML use English here and translate in String Translation. Detailed instructions <a href="https://wpml.org/documentation/support/translating-woocommerce-sites-default-language-english/">here</a>.
et: Kasutades WPML-i sisesta siia ingliskeelne tekst ja tõlgi see teistesse keeltesse String Translation all. Täpsemad juhised <a href="https://wpml.org/documentation/support/translating-woocommerce-sites-default-language-english/">siin</a>.

source: Enable/Disable
et: Luba/Keela

source: Enable EveryPay
et: Luba EveryPay

source: Payment form type
et: Maksevormi tüüp

source: Redirect to hosted form on EveryPay server
et: Edasisuunamine (redirect) EveryPay serveris olevale maksevormile

source: iFrame payment form integrated into checkout
et: Integreeritud iFrame maksevorm

source: Hosted form on EveryPay server is the secure solution of choice, while iFrame provides better customer experience (https strongly advised)
et: EveryPay serveris asuv maksevorm on turvalisim lahendus, samas pakub iFrame vorm paremat kasutajakogemust (https kasutamine on rangelt soovituslik)

source: Skin name
et: Skin’i nimi

source: Appearance of payment area can be set up in EveryPay Merchant Portal, under 'Settings' > 'iFrame skins'
et: Maksevormi välimust saab seadistada EveryPay Kaupmeheportaalis ‘Seaded’ -> ‘iFrame’i skin’id’

source: Saved cards
et: Salvestatud kaardid

source: Enable payments with saved cards
et: Võimalda maksed salvestatud kaartidega

source: When card token payments are enabled users get an option to store reference to credit card and can make future purchases without need to enter card details.
et: Kui kaartide turvaline salvestamine on lubatud pakutakse kasutajale võimalust kaardi-viite e. token’i salvestamiseks ja järgmiste ostude korral kaardiandmete sisestamist enam ei küsita.

source: Title
et: Nimetus

source: This controls the title which the user sees during checkout.
et: Võimaldab muuta makseviisi nimetust mida kuvatakse tellimuse vormistamisel.

source: Card payment
et: Kaardimakse

source: Description
et: Kirjeldus

source: This controls the description which the user sees during checkout.
et: Kirjeldust kuvatakse makseviisi valiku lehel.

source: Processing Account
et: Maksete konto

source: You'll find this in EveryPay Merchant Portal, under 'Settings' > 'Processing accounts' section (looks like: EUR1).
et: Leiad selle EveryPay Kaupmeheportaalist, 'Seaded' > 'Töötlemiskontod' all (see näeb välja umbes selline: EUR1).

source: Transaction Type
et: Makse tüüp

source: Charge
et: Kohene töötlemine

source: Authorisation
et: Autoriseering

source: Authorisation: A process of getting approval for the current payment. Funds are reserved on cardholder's account. Charge: An authorisation followed by immediate automatic capture.
et: Autoriseering: Toiming antud maksetehingule loa saamiseks. Tehingusumma broneeritakse kaardiomaniku kontol. Kohene töötlemine: Autoriseering ja sellele koheselt järgnev automaatne tehingu töötlemisele saatmine.

source: API username
et: API kasutajanimi

source: You'll find this in EveryPay Merchant Portal, under 'Settings' > 'General settings' section (looks like: 49bcdd6fed983c12).
et: Leiad selle EveryPay Kaupmeheportaalist, 'Seaded' > 'Üldised seaded' all (see näeb välja umbes selline: 49bcdd6fed983c12).

source: API secret
et: API salasõna

source: You'll find this in EveryPay Merchant Portal, under 'Settings' > 'General settings' section (looks like: e7ed4e55d5f73158f6cf2890fb1c950e).
et: Leiad selle EveryPay Kaupmeheportaalist, 'Seaded' > 'Üldised seaded' all (see näeb välja umbes selline: e7ed4e55d5f73158f6cf2890fb1c950e).

source: Debug Log
et: Logifail

source: Enable logging
et: Luba logimine

source: Log EveryPay events inside <code>%s</code>
et: Logib kõik EveryPay sündmused faili <code>%s</code>

source: Test
et: Test-režiim

source: Enable Test Mode
et: Luba test-režiim

source: Place the payment gateway in test mode using test API credentials (real payments will not be taken).
et: Paneb makseliidese test-režiimi mis kasutab eraldi API ligipääsutunuseid (tegelikke makseid ei teostata).

source: Test API username
et: Test API kasutajanimi

source: Optional: API username for testing payments.
et: Valikuline: API kasutajanimi test-režiimi jaoks.

source: Test API secret
et: Test API salasõna

source: Optional: API secret for testing payments.
et: Valikuline: API salasõna test-režiimi jaoks.

source: To save your card securely for easier future payments, sign up for an account or log in to your existing account.
et: Selleks, et oma kaart turvaliselt salvestada edasiste maksete lihtsustamiseks, registreeri konto või sisene olemasolevale kontole.

source: Save card securely
et: Salvesta kaart turvaliselt

source: expires
et: aegub

source: Use a new card
et: Kasuta uut kaarti

source: Manage cards
et: Halda kaarte

source: Payment was declined. Please verify the card data and try again with the same or different card.
et: Makse ebaõnnestus. Palun kontrolli kaardi andmeid ja proovi uuesti sama või muu kaardiga.

source: Payment cancelled.
et: Makse katkestatud.

source: An error occurred while processing the payment response, please notify merchant!
et: Makse töötlemisel tekkis tõrge, palun teavita kaupmeest!

source: Card payment was successfully processed by EveryPay (Reference: %s, Timestamp: %s)
et: Kaardimakse sooritati EveryPay poolt edukalt (Reference: %s, Timestamp: %s)

source: Processing payment with saved card...
et: Teostan makset salvestatud kaardiga…

source: Cancel order
et: Tühista tellimus

source: Try paying again
et: Proovi uuesti maksta

source: Thank you for your order. Please click the button below to complete the card payment.
et: Täname tellimuse eest! Kaardimakse alustamiseks klõpsa palun allolevat nuppu.

source: Cancel order &amp; restore cart
et: Tühista tellimus ja taasta ostukorv

source: Thank you for your order. We are now redirecting you to payment gateway.
et: Tänud tellimuse eest! Suuname sind edasi maksekeskkonda.

source: Manage saved cards
et: Halda salvestatud kaarte

source: Card
et: Kaart

source: Actions
et: Tegevused

source: Default
et: Vaikimisi

source: Make Default
et: Muuda vaikimisi

source: Delete
et: Kustuta

source: Cheatin&#8217; huh?
et: Proovid petta?

source: Payment Settings
et: Makse seadistused

source: Sorry, <strong>WooCommerce %s</strong> requires WooCommerce to be installed and activated first. Please install <a href="%s">WooCommerce</a> first.
et: Vabandust, aga <strong>WooCommerce %s</strong> eeldab WooCommerce paigaldamist ja aktiveerimist. Palun paigalda <a href="%s">WooCommerce</a> plugin.

source: WooCommerce %s depends on version 2.2 and up of WooCommerce for this gateway to work! Please upgrade before activating.
et: WooCommerce %s eeldab WooCommerce versiooni 2.2 või uuemat! Palun uuenda WooCommerce enne selle plugina aktiveerimist.
